nopnop2002/STM32_GD2/STM32_GD2.cpp
  ConfigRam cr;
  byte v8[128] = {0};
  cr.read(v8);

#if 0
  if ((v8[1] == 0xff) && (v8[2] == 0x01)) {
    options &= ~(GD_TRIM | GD_CALIBRATE);
    if (v8[3] & 2) {
      GDTR.__end();
      GDTR.hostcmd(0x44); // switch to external crystal
      GDTR.resume();
    }
    copyram(v8 + 4, 124);
    finish();
  } else {
#endif

// ******************************************************************************************

  if (FT800_model == 00) // FT800 Series
  {
	   GDTR.wr(REG_PCLK_POL, 1);
	   GDTR.wr(REG_PCLK, 5);
	    // Avoid inverted colours on alternative-FT800 boards
	   #if PROTO == 1
	      GDTR.wr(REG_SWIZZLE, 3);
	   #endif
	   GDTR.wr(REG_ROTATE, ROTACION);
  }


// ******************************************************************************************

  if(FT800_model == 0x10) // FT810
  {
	GD.wr32(REG_HCYCLE, 900);//548
	GD.wr32(REG_HOFFSET, 43);
	GD.wr32(REG_HSIZE, 800);
	GD.wr32(REG_HSYNC0, 0);
	GD.wr32(REG_HSYNC1, 41);
	GD.wr32(REG_VCYCLE, 500);
	GD.wr32(REG_VOFFSET, 12);
	GD.wr32(REG_VSIZE, 480);
	GD.wr32(REG_VSYNC0, 0);
	GD.wr32(REG_VSYNC1, 10);
	GD.wr32(REG_DITHER, 1);
	GD.wr32(REG_PCLK_POL, 1);//1
	GD.wr32(REG_PCLK, 3);//5
	GD.wr(REG_ROTATE, 0);
	GD.wr(REG_SWIZZLE, 0);//3 for GD2
  }

// ******************************************************************************************

  if(FT800_model == 0x11) // FT811
  {
	GD.wr32(REG_HCYCLE, 1000);//548
	GD.wr32(REG_HOFFSET, 43);
	GD.wr32(REG_HSIZE, 800);
	GD.wr32(REG_HSYNC0, 0);
	GD.wr32(REG_HSYNC1, 41);
	GD.wr32(REG_VCYCLE, 500);
	GD.wr32(REG_VOFFSET, 12);
	GD.wr32(REG_VSIZE, 480);
	GD.wr32(REG_VSYNC0, 0);
	GD.wr32(REG_VSYNC1, 10);
	GD.wr32(REG_DITHER, 1);
	GD.wr32(REG_PCLK_POL, 1);//1
	GD.wr32(REG_PCLK, 3);//5
	GD.wr(REG_ROTATE, 0);
	GD.wr(REG_SWIZZLE, 0);//3 for gameduino 2
  }


// ******************************************************************************************

  if(FT800_model == 0x13) // FT813
  {
	GD.wr32(REG_HSIZE, 800);
	GD.wr32(REG_VSIZE, 480);
	GD.wr32(REG_HCYCLE, 1056);//1000
	GD.wr32(REG_HOFFSET, 46);
	GD.wr32(REG_HSYNC0, 0);
	GD.wr32(REG_HSYNC1, 10); //41
	GD.wr32(REG_VCYCLE, 525);
	GD.wr32(REG_VOFFSET, 23);
	GD.wr32(REG_VSYNC0, 0);
	GD.wr32(REG_VSYNC1, 10);
	GD.wr32(REG_PCLK, 2);//5
	GD.wr32(REG_SWIZZLE, 0);//3 for GD2
	GD.wr32(REG_PCLK_POL, 1);//1
	GD.wr32(REG_CSPREAD, 0);
	GD.wr32(REG_DITHER, 0);
	//GD.wr(REG_ROTATE, 0);

	//GD.wr32(REG_HSIZE, 800);
	//GD.wr32(REG_VSIZE, 480);
	//GD.wr32(REG_HCYCLE, 1000);//548
	//GD.wr32(REG_HOFFSET, 46);
	//GD.wr32(REG_HSYNC0, 0);
	//GD.wr32(REG_HSYNC1, 41);
	//GD.wr32(REG_VCYCLE, 525);
	//GD.wr32(REG_VOFFSET, 23);
	//GD.wr32(REG_VSYNC0, 0);
	//GD.wr32(REG_VSYNC1, 10);
	//GD.wr32(REG_PCLK, 2);//5

	//GD.wr32(REG_DITHER, 0);
	//GD.wr32(REG_PCLK_POL, 1);//1
	//GD.wr(REG_ROTATE, 0);
	//GD.wr(REG_SWIZZLE, 0);//3 for GD2
  }

// ******************************************************************************************

  if(FT800_model == 0x14) // FT814
  {
    GD.wr32(REG_HCYCLE, 1056);    // 900 //548
    GD.wr32(REG_HOFFSET, 88);     // 46
    GD.wr32(REG_HSIZE, 800);
    GD.wr32(REG_HSYNC0, 0);
    GD.wr32(REG_HSYNC1, 10);      // 41
    GD.wr32(REG_VCYCLE, 525);     // 500
    GD.wr32(REG_VOFFSET, 32);     // 23
    GD.wr32(REG_VSIZE, 480);
    GD.wr32(REG_VSYNC0, 0);
    GD.wr32(REG_VSYNC1, 10);

    GD.wr32(REG_PCLK, 2);
    GD.wr32(REG_PCLK_POL, 0);
    GD.wr32(REG_CSPREAD, 0);       // 1
    GD.wr32(REG_DITHER, 1);        // 1


	//GD.wr32(REG_HSIZE, 800);
	//GD.wr32(REG_HCYCLE, 928);//548
	//GD.wr32(REG_HOFFSET, 88);
	//GD.wr32(REG_HSYNC0, 0);
	//GD.wr32(REG_HSYNC1, 48);

	//GD.wr32(REG_VSIZE, 480);
	//GD.wr32(REG_VCYCLE, 525);
	//GD.wr32(REG_VOFFSET, 32);
	//GD.wr32(REG_VSYNC0, 0);
	//GD.wr32(REG_VSYNC1, 3);

	//GD.wr32(REG_PCLK, 2);//5
	//GD.wr32(REG_PCLK_POL, 0);//1
	//GD.wr32(REG_CSPREAD, 0);//1
	//GD.wr32(REG_DITHER, 1);
  }

// ******************************************************************************************

  if(FT800_model == 0x15) // FT815
  {
	GD.wr32(REG_HSIZE, 480);
	GD.wr32(REG_HCYCLE, 548);
	GD.wr32(REG_HOFFSET, 43);
	GD.wr32(REG_HSYNC0, 0);
	GD.wr32(REG_HSYNC1, 41);

	GD.wr32(REG_VSIZE, 272);
	GD.wr32(REG_VCYCLE, 292);
	GD.wr32(REG_VOFFSET, 12);
	GD.wr32(REG_VSYNC0, 0);
	GD.wr32(REG_VSYNC1, 10);

	GD.wr32(REG_PCLK, 5);//5
	GD.wr32(REG_SWIZZLE, 0);//3 for GD2
	GD.wr32(REG_PCLK_POL, 1);//1
	GD.wr32(REG_CSPREAD, 1);//1
	GD.wr32(REG_DITHER, 1);
	//GD.wr(REG_ROTATE, 0);
  }


// ******************************************************************************************

  if(FT800_model == 0x16) // FT816
  {
	GD.wr32(REG_HSIZE, 320);
	GD.wr32(REG_HCYCLE, 408);
	GD.wr32(REG_HOFFSET, 70);
	GD.wr32(REG_HSYNC0, 0);
	GD.wr32(REG_HSYNC1, 10);

	GD.wr32(REG_VSIZE, 240);
	GD.wr32(REG_VCYCLE, 263);
	GD.wr32(REG_VOFFSET, 13);
	GD.wr32(REG_VSYNC0, 0);
	GD.wr32(REG_VSYNC1, 2);

	GD.wr32(REG_PCLK, 6);//5
	GD.wr32(REG_SWIZZLE, 2);//3 for GD2
	GD.wr32(REG_PCLK_POL, 1);//1
	GD.wr32(REG_CSPREAD, 0);//1
	GD.wr32(REG_DITHER, 1);
	//GD.wr(REG_ROTATE, 0);
  }


  w = GDTR.rd16(REG_HSIZE);
  h = GDTR.rd16(REG_VSIZE);
  model = 800;
  if (FT800_model != 0) model = 800 + (FT800_model - 6);
  //loadptr = 0;

  // Work-around issue with bitmap sizes not being reset
  for (byte i = 0; i < 32; i++) {
    BitmapHandle(i);
    cI(0x28000000UL);
    cI(0x29000000UL);
  }

  Clear(); swap();
  Clear(); swap();
  Clear(); swap();

  if (FT800_model == 0x14)
  {
    cmd_regwrite(REG_PWM_DUTY, 102);
  }else{
    cmd_regwrite(REG_PWM_DUTY, 128);
  }

//FT81XMANIA TEAM (TFTLCDCyg)
  if (FT800_model != 0)
  {
    cmd_setrotate(ORIENTACION);
  }

  if (FT800_model == 0)
  {
    GDTR.wr(REG_ROTATE, ROTACION);
  }
//FT81XMANIA TEAM (TFTLCDCyg)

  GD.flush();

  int calibrate = 0;
  if (options & GD_CALIBRATE) calibrate = 1;
  if (options & FORCE_CALIBRATE) calibrate = 2;
//Serial.println("calibrate=" + String(calibrate));


//  if (CALIBRATION & (options & GD_CALIBRATE)){
//  if (CALIBRATION & (calibrate != 0)) {
  if (calibrate != 0) {
    uint16 Status;
    uint16_t Data;
    Status = EEPROM.read(0x10,&Data);
//Serial.print("Data.EEPROM[10]=");
//Serial.println(Data,HEX);
//Serial.println("Status=" + String(Status));
    if (Data != 0x7c || calibrate == 2) {
      self_calibrate();
      EEPROM.format();
      for (int i = 0; i < 24; i++) { 
		Data = GDTR.rd(REG_TOUCH_TRANSFORM_A + i);
//Serial.print("Data.rd[" + String(i) + "]=");
//Serial.println(Data, HEX);
        Status = EEPROM.write(0x20 + i, Data);
      }
      Status = EEPROM.write(0x10, 0x7c);  // is written!
//Serial.println("Status=" + String(Status));
    } else {
      for (int i = 0; i < 24; i++) {
		Status=EEPROM.read(0x20+i,&Data);
//Serial.print("Data.EEPROM[=" + String(i) + "]=");
//Serial.println(Data,HEX);
        GDTR.wr(REG_TOUCH_TRANSFORM_A + i, Data);
      }
    }

