nopnop2002/STM32_GD2/STM32_GD2.cpp
  int offset=0;
  int offsetFT;
  int bytesDisponibles;
  int wbn;
  
  GD.__end();
  
  if (archivo) {
    
	int tamArchivo=archivo.available();
    
    while( offset < tamArchivo)
    {
        uint16_t m = ( (archivo.available() > TAM_BUFFER_SD) ? TAM_BUFFER_SD : archivo.available());
        archivo.read(buf,m);
        
        offsetFT=0;
        bytesDisponibles=m;
        while (offsetFT < m) 
        {
              uint16_t n = ( (bytesDisponibles > TAM_BUFFER_FT) ? TAM_BUFFER_FT : bytesDisponibles);
             
              wbn = (n + 3) & ~3;   // force 32-bit alignment

              GD.resume();
              if (progress)
                (*progress)((offset+offsetFT), tamArchivo);
#ifdef DUMMY_GDCOPYRAM
                memcpy (FTbuf, buf+offsetFT, wbn );
#else
                GD.copyram((buf+offsetFT), wbn);
#endif              
              offsetFT+=n;
              bytesDisponibles-=n;
              GDTR.stop();
        }
        offset+=m;         
    }	
            
    GD.resume();
    SPI.endTransaction();
    return 1;
  }
  GD.resume();
  SPI.endTransaction();
  return 0;
}

// Generated by mk_bsod.py. Blue screen with 'ERROR' text
static const PROGMEM uint8_t __bsod[32] = {
0, 255, 255, 255, 96, 0, 0, 2, 7, 0, 0, 38, 12, 255, 255, 255, 240, 0,
90, 0, 31, 0, 0, 6, 69, 82, 82, 79, 82, 0, 0, 0
};
static const PROGMEM uint8_t __bsod_badfile[32] = {
12, 255, 255, 255, 240, 0, 148, 0, 29, 0, 0, 6, 67, 97, 110, 110, 111,
116, 32, 111, 112, 101, 110, 32, 102, 105, 108, 101, 58, 0, 0, 0
};

// Fatal error alert.
// Show a blue screen with message.
// This method never returns.

void GDClass::alert(const char *message)
{
  begin(0);
  //copy(__bsod, sizeof(__bsod));
  //cmd_text(240, 176, 29, OPT_CENTER, message);
  cmd_dlstart();
 
  if(FT800_model != 0){cmd_setrotate(ORIENTACION);}
  if(FT800_model == 0){GDTR.wr(REG_ROTATE, ROTACION);}

  ClearColorRGB(0x650000);
  Clear();

  if (strlen(message) == 0) {
    cmd_text(GD.w / 2, (GD.h / 2)-29, 31, OPT_CENTER, "Error on STM32");
  } else {
    if (strlen(message) < 20) {
      cmd_text(GD.w / 2, (GD.h / 2)-29, 31, OPT_CENTER, message);
    } else {
      cmd_text(GD.w / 2, (GD.h / 2)-29, 29, OPT_CENTER, message);
    }
  }
  cmd_text(GD.w / 2, (GD.h / 2)+29, 29, OPT_CENTER, "Invalid operation");

  swap();
  finish();
  for (;;)
    ;
}

void GDClass::safeload(const char *filename)
{
  if (!load(filename)) {
    copy(__bsod, sizeof(__bsod));
    //copy(__bsod_badfile, sizeof(__bsod_badfile));
    //cmd_text(240, 190, 29, OPT_CENTER, filename);
    cmd_text(0, GD.h/2, 29, 0, "- Check asset file name inside of the sketch");
    cmd_text(0, GD.h/2+30, 29, 0, "- Copy *.gd2 in the SD card");
    swap();
    for (;;)
      ;
  }
}

#if 0
void GDClass::safeloadSdFat(File& archivo)
{
  if (!loadSdFat(archivo)) {
    copy(__bsod, sizeof(__bsod));
    //copy(__bsod_badfile, sizeof(__bsod_badfile));
    //cmd_text(240, 190, 29, OPT_CENTER, archivo.name());
    cmd_text(0, GD.h/2, 29, 0, "- Check asset file name inside of the sketch");
    cmd_text(0, GD.h/2+30, 29, 0, "- Copy *.gd2 in the SD card");
    swap();
    for (;;)
      ;
  }
}
#endif

#define REG_SCREENSHOT_EN    (ft8xx_model ? 0x302010UL : 0x102410UL) // Set to enable screenshot mode
#define REG_SCREENSHOT_Y     (ft8xx_model ? 0x302014UL : 0x102414UL) // Y line register
#define REG_SCREENSHOT_START (ft8xx_model ? 0x302018UL : 0x102418UL) // Screenshot start trigger
#define REG_SCREENSHOT_BUSY  (ft8xx_model ? 0x3020e8UL : 0x1024d8UL) // Screenshot ready flags
#define REG_SCREENSHOT_READ  (ft8xx_model ? 0x302174UL : 0x102554UL) // Set to enable readout
#define RAM_SCREENSHOT       (ft8xx_model ? 0x3c2000UL : 0x1C2000UL) // Screenshot readout buffer

#ifndef DUMPDEV
void GDClass::dumpscreen(void)    
{
  {
    finish();

    wr(REG_SCREENSHOT_EN, 1);
    Serial.write(0xa5);
    Serial.write(GD.w & 0xff);
    Serial.write((GD.w >> 8) & 0xff);
    Serial.write(GD.h & 0xff);
    Serial.write((GD.h >> 8) & 0xff);
    for (int ly = 0; ly < GD.h; ly++) {
      wr16(REG_SCREENSHOT_Y, ly);
      wr(REG_SCREENSHOT_START, 1);
      delay(2);
      while (rd32(REG_SCREENSHOT_BUSY) | rd32(REG_SCREENSHOT_BUSY + 4))
        ;
      wr(REG_SCREENSHOT_READ, 1);
      bulkrd(RAM_SCREENSHOT);
      SPI.transfer(0xff);
      for (int x = 0; x < GD.w; x += 8) {
        union {
          uint32_t v;
          struct {
            uint8_t b, g, r, a;
          };
        } block[8];
        for (int i = 0; i < 8; i++) {
          block[i].b = SPI.transfer(0xff);
          block[i].g = SPI.transfer(0xff);
          block[i].r = SPI.transfer(0xff);
          block[i].a = SPI.transfer(0xff);
        }
        // if (x == 0) block[0].r = 0xff;
        byte difference = 1;
        for (int i = 1, mask = 2; i < 8; i++, mask <<= 1)
          if (block[i].v != block[i-1].v)
            difference |= mask;
        Serial.write(difference);

        for (int i = 0; i < 8; i++)
          if (1 & (difference >> i)) {
            Serial.write(block[i].b);
            Serial.write(block[i].g);
            Serial.write(block[i].r);
          }
      }
      resume();
      wr(REG_SCREENSHOT_READ, 0);
    }
    wr16(REG_SCREENSHOT_EN, 0);
  }
}
#endif
